## Terraform Summary

#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`

<details><summary>Validation output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Plan output</summary>

```
data.cloudflare_zone.dns: Reading...
data.b2_account_info.current: Reading...
b2_bucket.backups: Refreshing state... [id=6b4d02379103e55986b90615]
data.cloudflare_zone.dns: Read complete after 1s [id=de28d1d508a00b8f16cba5423742f3fc]
cloudflare_record.domains["status"]: Refreshing state... [id=c5ad61730fa6e01c14a161625d2d4b94]
cloudflare_record.domains["vault"]: Refreshing state... [id=e1c67256f6a249cf1110aad0b1b0ddee]
cloudflare_record.domains["unifi"]: Refreshing state... [id=55f778148dee837a40d83814d6a1807d]
aws_s3_bucket.longhorn_backup: Refreshing state... [id=k2net-longhorn-backup]
data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01b68f5eb060585f1]
aws_secretsmanager_secret.netmaker_access_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:940573904002:secret:NETMAKER_ACCESS_KEY-tD0tE7]
data.aws_caller_identity.current: Read complete after 0s [id=940573904002]
aws_budgets_budget.monthly: Refreshing state... [id=940573904002:AWS Monthly Budget]
aws_key_pair.ssh: Refreshing state... [id=k2net-key]
data.aws_iam_account_alias.current: Reading...
data.aws_ami.ubuntu: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-2]
aws_s3_bucket.cdn: Refreshing state... [id=s3.kyle2.net]
data.aws_iam_account_alias.current: Read complete after 0s [id=k2net]
aws_iam_role.dlm_lifecycle: Refreshing state... [id=tf-k2net-ServiceRoleForDLM]
aws_iam_role.read_netmaker_secret: Refreshing state... [id=tf-k2net-ReadOnly-NetmakerSecret-Role]
aws_secretsmanager_secret_version.netmaker_access_key: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:940573904002:secret:NETMAKER_ACCESS_KEY-tD0tE7|645DA182-0D4A-451E-AF4E-8D52106100EF]
data.template_file.netmaker_secret_policy: Reading...
data.template_file.netmaker_secret_policy: Read complete after 0s [id=e62aaa1ef7c9691ddde30825a0e1e0a465565b06ce4e447a2885413979d16a30]
data.template_file.userdata_netclient: Reading...
data.template_file.userdata_netclient: Read complete after 0s [id=d20dfd0ccce90092a5744096b19507a658ebe74785f260b338d15f2ffc21eb64]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0abfdbd26148cb0b5]
data.b2_account_info.current: Read complete after 2s [id=bd2713596965]
aws_iam_role_policy.dlm_lifecycle: Refreshing state... [id=tf-k2net-ServiceRoleForDLM:tf-k2net-dlm-lifecycle-policy]
aws_dlm_lifecycle_policy.snapshots: Refreshing state... [id=policy-0b85b904e81e7c54f]
aws_iam_role_policy.read_netmaker_secret: Refreshing state... [id=tf-k2net-ReadOnly-NetmakerSecret-Role:tf-k2net-ReadOnly-NetmakerSecret-Policy]
aws_iam_instance_profile.ec2_read_netmaker_secret: Refreshing state... [id=tf-k2net-ReadOnly-NetmakerSecret-ec2InstanceProfile]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0aec7d42f6b10efd1]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-074783d08ee39f101]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d9cd0d4c4e55ad0b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b8c54ff8899075a5]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-03070963815bbd46c]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06495d04b96f36bea]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07cba58245ddb1126]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0514148e8910724a1]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0142b248bf623ae1a]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0241b151161dde09b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-081d1ec2be4714233]
aws_security_group.web: Refreshing state... [id=sg-0c7afa991539785f0]
aws_security_group.ssh: Refreshing state... [id=sg-0220cd444f4c9f9ff]
aws_security_group.dns: Refreshing state... [id=sg-09bda0fa555ea4318]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-043a40d9c0afaa4a7]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0aeefda4b8e574240]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00c7c5aa125c04a2b]
aws_security_group.ingress_ports: Refreshing state... [id=sg-021051b8c98cd6f0b]
aws_security_group.gateway: Refreshing state... [id=sg-01d1e2f2f4f174ac5]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-002edeba5e2e8ecc5]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-064a74c4a91d30aac]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07c5d6143dd08782d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-074783d08ee39f1011080289494]
aws_security_group_rule.ssh[0]: Refreshing state... [id=sgrule-3003451966]
aws_security_group_rule.dns: Refreshing state... [id=sgrule-2203802245]
aws_s3_bucket_lifecycle_configuration.longhorn_backup_cleanup: Refreshing state... [id=k2net-longhorn-backup]
aws_s3_bucket_public_access_block.longhorn_backup_access_block: Refreshing state... [id=k2net-longhorn-backup]
aws_s3_bucket_server_side_encryption_configuration.longhorn_backup_sse: Refreshing state... [id=k2net-longhorn-backup]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0c14a7c1809ee63af]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-08f29883aae718ddf]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f741db5346ff0abe]
aws_security_group_rule.ingress_ports["UniFi HTTP"]: Refreshing state... [id=sgrule-2409339226]
aws_security_group_rule.ingress_ports["UniFi HTTPS"]: Refreshing state... [id=sgrule-1825443955]
aws_security_group_rule.ingress_ports["UniFi STUN"]: Refreshing state... [id=sgrule-2324349940]
aws_security_group_rule.ingress_ports["UniFi SpeedTest"]: Refreshing state... [id=sgrule-394985030]
aws_security_group_rule.ingress_ports["UniFi Discovery"]: Refreshing state... [id=sgrule-1411886548]
aws_security_group_rule.ingress_ports["UniFi API"]: Refreshing state... [id=sgrule-1607683805]
aws_security_group_rule.ingress_ports["UniFi Control"]: Refreshing state... [id=sgrule-2911761006]
aws_security_group_rule.ingress_ports["UniFi L2 Discovery"]: Refreshing state... [id=sgrule-2987607047]
aws_security_group_rule.wireguard: Refreshing state... [id=sgrule-3106070236]
aws_security_group_rule.http: Refreshing state... [id=sgrule-461731237]
aws_security_group_rule.https: Refreshing state... [id=sgrule-1430041704]
aws_acm_certificate.cdn: Refreshing state... [id=arn:aws:acm:us-east-1:940573904002:certificate/3f1b9be4-fd8d-47d1-b559-705cb83f7f39]
aws_s3_bucket_server_side_encryption_configuration.cdn_sse: Refreshing state... [id=s3.kyle2.net]
aws_s3_bucket_public_access_block.cdn_access_block: Refreshing state... [id=s3.kyle2.net]
aws_s3_bucket_lifecycle_configuration.cdn_cleanup: Refreshing state... [id=s3.kyle2.net]
aws_cloudfront_origin_access_control.cdn: Refreshing state... [id=E2MWPB5GAFCOR0]
data.aws_security_group.default: Reading...
data.aws_security_group.default: Read complete after 0s [id=sg-0241b151161dde09b]
aws_instance.forward_proxy: Refreshing state... [id=i-0c6cc23df2689cb20]
aws_instance.pihole: Refreshing state... [id=i-08a7751dd3cf4417d]
cloudflare_record.cdn_validation["s3.kyle2.net"]: Refreshing state... [id=9ace5aff2af19361f292b0af0dc39449]
aws_acm_certificate_validation.cdn: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_cloudfront_distribution.cdn: Refreshing state... [id=E25YI3U45G9DS3]
data.template_file.cloudfront_s3_policy: Reading...
cloudflare_record.cdn: Refreshing state... [id=3d18e34daa993287f62b806ab4ad31d2]
data.template_file.cloudfront_s3_policy: Read complete after 0s [id=c6dd30924c7f91cecb9b0dcb13fb82a3c9654ea7b4e0379466839d79afb574f3]
aws_s3_bucket_policy.cdn_cloudfront: Refreshing state... [id=s3.kyle2.net]
aws_eip.pihole: Refreshing state... [id=eipalloc-0e5c09bd7debbfb58]
aws_eip.forward_proxy: Refreshing state... [id=eipalloc-004cdc1af538cb814]
cloudflare_record.forward_proxy: Refreshing state... [id=e3041e0935770488a5a83528a1529d91]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # b2_bucket.public will be created
  + resource "b2_bucket" "public" {
      + account_id  = (known after apply)
      + bucket_id   = (known after apply)
      + bucket_name = "k2net-public"
      + bucket_type = "allPublic"
      + id          = (known after apply)
      + options     = (known after apply)
      + revision    = (known after apply)

      + default_server_side_encryption {
          + algorithm = "AES256"
          + mode      = "SSE-B2"
        }

      + lifecycle_rules {
          + days_from_hiding_to_deleting = 1
        }
    }

  # cloudflare_record.b2 will be created
  + resource "cloudflare_record" "b2" {
      + allow_overwrite = true
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "b2"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "f005.backblazeb2.com"
      + zone_id         = "de28d1d508a00b8f16cba5423742f3fc"
    }

  # cloudflare_ruleset.b2_request_url_rewrites will be created
  + resource "cloudflare_ruleset" "b2_request_url_rewrites" {
      + description = (known after apply)
      + id          = (known after apply)
      + kind        = "zone"
      + name        = "Backblaze B2 URL Rewrite"
      + phase       = "http_request_transform"
      + zone_id     = "de28d1d508a00b8f16cba5423742f3fc"

      + rules {
          + action       = "rewrite"
          + description  = (known after apply)
          + enabled      = true
          + expression   = "(http.host eq \"b2.kyle2.net\" and not starts_with(http.request.uri.path, \"/file/k2net-public\"))"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = (known after apply)
          + version      = (known after apply)

          + action_parameters {
              + version = (known after apply)

              + uri {
                  + path {
                      + expression = "concat(\"/file/k2net-public\",http.request.uri.path)"
                    }
                }
            }
        }
    }

  # cloudflare_ruleset.b2_response_header_rewrites will be created
  + resource "cloudflare_ruleset" "b2_response_header_rewrites" {
      + description = (known after apply)
      + id          = (known after apply)
      + kind        = "zone"
      + name        = "Backblaze HTTP Response Headers"
      + phase       = "http_response_headers_transform"
      + zone_id     = "de28d1d508a00b8f16cba5423742f3fc"

      + rules {
          + action       = "rewrite"
          + description  = (known after apply)
          + enabled      = true
          + expression   = "(http.host eq \"b2.kyle2.net\")"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = (known after apply)
          + version      = (known after apply)

          + action_parameters {
              + version = (known after apply)

              + headers {
                  + name      = "x-bz-file-name"
                  + operation = "remove"
                }
              + headers {
                  + name      = "x-bz-file-id"
                  + operation = "remove"
                }
              + headers {
                  + name      = "x-bz-content-sha1"
                  + operation = "remove"
                }
              + headers {
                  + name      = "x-bz-upload-timestamp"
                  + operation = "remove"
                }
              + headers {
                  + name      = "x-bz-info-src_last_modified_millis"
                  + operation = "remove"
                }
              + headers {
                  + expression = "concat(http.response.headers[\"x-bz-content-sha1\"][0],http.response.headers[\"x-bz-upload-timestamp\"][0],http.response.headers[\"x-bz-file-id\"][0])"
                  + name       = "ETag"
                  + operation  = "set"
                }
              + headers {
                  + expression = "*"
                  + name       = "Access-Control-Allow-Origin"
                  + operation  = "set"
                }
            }
        }
    }

  # cloudflare_zone_settings_override.main will be created
  + resource "cloudflare_zone_settings_override" "main" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + readonly_settings        = (known after apply)
      + zone_id                  = "de28d1d508a00b8f16cba5423742f3fc"
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = (known after apply)
          + always_use_https            = (known after apply)
          + automatic_https_rewrites    = "on"
          + binary_ast                  = (known after apply)
          + brotli                      = "on"
          + browser_cache_ttl           = 0
          + browser_check               = "on"
          + cache_level                 = "aggressive"
          + challenge_ttl               = 3600
          + ciphers                     = (known after apply)
          + cname_flattening            = "flatten_at_root"
          + development_mode            = (known after apply)
          + early_hints                 = "on"
          + email_obfuscation           = (known after apply)
          + filter_logs_to_cloudflare   = (known after apply)
          + fonts                       = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = (known after apply)
          + http2                       = "on"
          + http3                       = "on"
          + image_resizing              = (known after apply)
          + ip_geolocation              = "on"
          + ipv6                        = "on"
          + log_to_cloudflare           = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = "1.2"
          + mirage                      = (known after apply)
          + opportunistic_encryption    = "on"
          + opportunistic_onion         = "on"
          + orange_to_orange            = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + origin_max_http_version     = (known after apply)
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = (known after apply)
          + proxy_read_timeout          = (known after apply)
          + pseudo_ipv4                 = (known after apply)
          + response_buffering          = (known after apply)
          + rocket_loader               = (known after apply)
          + security_level              = "medium"
          + server_side_exclude         = (known after apply)
          + sort_query_string_for_cache = (known after apply)
          + ssl                         = "strict"
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = "on"
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + universal_ssl               = (known after apply)
          + visitor_ip                  = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = "on"
          + zero_rtt                    = "on"

          + minify {
              + css  = "on"
              + html = "on"
              + js   = "on"
            }

          + security_header {
              + enabled            = false
              + include_subdomains = (known after apply)
              + max_age            = (known after apply)
              + nosniff            = (known after apply)
              + preload            = (known after apply)
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>